{
    "items": 
    [
        {
          "title": "Google STEP Intern",
          "img-src": "https://cdn4.iconfinder.com/data/icons/logos-brands-7/512/google_logo-google_icongoogle-1024.png",
          "img-alt": "Google Logo",
          "description": "Worked within Android Core Experiments and Gantry to develop and implement new feature flags for project workflows using Java, TypeScript, Guice (dependency injection), and Redux. Designed and implemented Remote Procedure Calls to enable seamless backend communication, and developed numerous frontend features where the RPCs were integrated, resulting in dynamic and user-friendly interfaces.",
          "link": "https://buildyourfuture.withgoogle.com/programs/step"
        },
        {
          "title": "Electrical and Computer Engineering Dept. Software Intern",
          "img-src": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Seal_of_the_University_of_California%2C_San_Diego.svg",
          "img-alt": "UCSD Logo",
          "description": "Worked with Professors Curt Schurgers and Ramsin Khoshabeh to design and create an enhanced access control system for numerous spaces at UCSD. As a backend developer, I utilized MySQL, TypeScript, Express.js, and Node.js to create a centralized database and server.",
          "link": "https://ersp.ucsd.edu/"
        },
        {
          "title": "Sponsor Energy Inc. Marketing and IT Intern",
          "img-src": "https://calgarydropin.ca/wp-content/uploads/2021/07/444-4446647_sponsor-energy-logo-graphics-clipart-1.png",
          "img-alt": "Sponsor Energy Logo",
          "description": "Worked at Sponsor Energy, designing and creating an FAQ page for the company website using HTML, CSS, and PHP. Also worked on remodeling the client billing platform into a more user-friendly interface using React.js and JavaScript.",
          "link": "https://sponsorenergy.com/?srsltid=AfmBOoqE8xAHg6JX-4_qumXYsmpViSRd-erQEOtv4YwAZOqsPs9PJmWM"
        },
        {
          "title": "Triton Software Engineering Software Developer",
          "img-src": "https://cse.ucsd.edu/sites/default/files/top-level/tse-logo-yellow.png",
          "img-alt": "TSE Logo",
          "description": "Triton Software Engineering is a multidisciplinary student organization at UC San Diego. I work as a software developer, implementing a web and mobile application for the San Diego County Taxpayers Association using MongoDB, Express, React, Node, and React Redux.",
          "link": "https://tritonse.github.io/"
        },
        {
          "title": "Triton Robotics Embedded Developer",
          "img-src": "https://avatars.githubusercontent.com/u/74093064?s=200&v=4",
          "img-alt": "Triton Robotics Logo",
          "description": "Worked on coding an STM-32 nucleo board to control motors, sensors, and actuators, allowing for robot movement. Developed Mutex threading to more efficiently print to console while running robot code. Currently working on a centralized turret class for multiple robots.",
          "link": "https://tritonrobotics.org/"
        }
      ]

}